lkolbly/cmsis-svd/data/TexasInstruments/LM3S9L71.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <prependToName>ADC1</prependToName>
      <baseAddress>0x40039000</baseAddress>
    </peripheral>
    <peripheral>
      <name>COMP</name>
      <description>Register map for COMP peripheral</description>
      <groupName>COMP</groupName>
      <prependToName>COMP</prependToName>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACMIS</name>
          <description>Analog Comparator Masked Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>COMP_ACMIS_IN0</name>
              <description>Comparator 0 Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACMIS_IN1</name>
              <description>Comparator 1 Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACRIS</name>
          <description>Analog Comparator Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>COMP_ACRIS_IN0</name>
              <description>Comparator 0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACRIS_IN1</name>
              <description>Comparator 1 Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACINTEN</name>
          <description>Analog Comparator Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>COMP_ACINTEN_IN0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACINTEN_IN1</name>
              <description>Comparator 1 Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACREFCTL</name>
          <description>Analog Comparator Reference Voltage Control</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>COMP_ACREFCTL_VREF</name>
              <description>Resistor Ladder Voltage Ref</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACREFCTL_RNG</name>
              <description>Resistor Ladder Range</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP_ACREFCTL_EN</name>
              <description>Resistor Ladder Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSTAT0</name>
          <description>Analog Comparator Status 0</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>COMP_ACSTAT0_OVAL</name>
              <description>Comparator Output Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCTL0</name>
          <description>Analog Comparator Control 0</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>COMP_ACCTL0_CINV</name>
              <description>Comparator Output Invert</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_ISEN</name>
              <description>Interrupt Sense</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_TSEN</name>
              <description>Trigger Sense</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_LEVEL</name>
                  <description>Level sense, see TSLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_TSLVAL</name>
              <description>Trigger Sense Level Value</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_ASRCP</name>
              <description>Analog Source Positive</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_REF</name>
                  <description>Internal voltage reference (VIREF)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_TOEN</name>
              <description>Trigger Output Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSTAT1</name>
          <description>Analog Comparator Status 1</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>COMP_ACSTAT1_OVAL</name>
              <description>Comparator Output Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCTL1</name>
          <description>Analog Comparator Control 1</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>COMP_ACCTL1_CINV</name>
              <description>Comparator Output Invert</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL1_ISEN</name>
              <description>Interrupt Sense</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL1_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL1_TSEN</name>
              <description>Trigger Sense</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_LEVEL</name>
                  <description>Level sense, see TSLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL1_TSLVAL</name>
              <description>Trigger Sense Level Value</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL1_ASRCP</name>
              <description>Analog Source Positive</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ASRCP_REF</name>
                  <description>Internal voltage reference (VIREF)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL1_TOEN</name>
              <description>Trigger Output Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
